kalman-folding-04-009-streams-observables.org
** A Test Example

In the following  example, the observations $\mathbold{z}$ are
$1\times{1}$ matrices, equivalent to scalars, so $b=1$.

The function in equation \ref{eqn:kalman-cume-definition}
/lambda-lifts/[fn:lmlf] $\mathbold{Z}$, meaning that it is necessary to call
/kalmanStatic/ with a constant $\mathbold{Z}$ to get the actual accumulator
function used in folds. This is desirable to reduce coupling between the
accumulator function and its calling environment. 

In Wolfram, this function is

#+BEGIN_LaTeX
\begin{verbatim}
kalmanStatic[Zeta_][{x_, P_}, {A_, z_}] :=
 Module[{D, K},
  D = Zeta + A.P.Transpose[A];
  K = P.Transpose[A].Inverse[D];
  {x2 + K.(z - A.x), P - K.D.Transpose[K]}]
\end{verbatim}
#+END_LaTeX

We test it on a small case

#+BEGIN_LaTeX
\begin{verbatim}
Fold[kalmanStatic[IdentityMatrix[1]],
  {ColumnVector[{0, 0, 0, 0}], IdentityMatrix[4]*1000.0},
  {{{{1,  0., 0.,  0.}}, { -2.28442}}, 
   {{{1,  1., 1.,  1.}}, { -4.83168}}, 
   {{{1, -1., 1., -1.}}, {-10.46010}}, 
   {{{1, -2., 4., -8.}}, {  1.40488}}, 
   {{{1,  2., 4.,  8.}}, {-40.8079}}}
  ] // Chop
~~>
\end{verbatim}
#+END_LaTeX

#+BEGIN_LaTeX
\begin{align}
\label{eqn:kalman-filter-results}
\mathbold{x} &=
\begin{bmatrix}
 -2.97423 \\
  7.2624  \\
 -4.21051 \\
 -4.45378 \\
\end{bmatrix}
\\
\notag
\mathbold{P} &=
\begin{bmatrix}
 0.485458 & 0 & -0.142778 & 0 \\
 0 & 0.901908 & 0 & -0.235882 \\
 -0.142778 & 0 & 0.0714031 & 0 \\
 0 & -0.235882 & 0 & 0.0693839 \\
\end{bmatrix}
\end{align}
#+END_LaTeX

\noindent expecting results within one or two standard deviations of the ground
truth $\aleph=\begin{bmatrix}-3& 9& -4& -5\end{bmatrix}^\intercal$, where the
standard deviations can be found as square roots of the diagonal
elements of $\mathbold{P}$. For details about this test case, see the first
paper in the series, /Kalman Folding, Part 1/.[fn:klfl]

Below, we reproduce these values exactly, to the bit level, by running
/kalmanStatic/ over lazy streams and asynchronous observables.

* Types for Kalman Folding

Kalman and all its variants are examples of /statistical function inversion./ We
have models that predict outcomes from inputs; we observe outcomes and want
estimates of the inputs. Structurally, all such incremental model inversions
take a pair of a state estimate (with uncertainty) and an observation, and
produce a new state estimate (with uncertainty). Such an inverted model has
signature, using a type notation similar to that of Haskell or Scala

#+BEGIN_LaTeX
\begin{equation*}
\textrm{inverted-model}
\left[S,T\right]
::
\left(S\rightarrow{T}\rightarrow{S}\right)
\end{equation*}
#+END_LaTeX

\noindent where the
return type is on the far right and the other types that appear before arrows
are the types of input arguments.
This function signature is exactly that required for the first argument of a
functional fold (more precisely, a /left/ fold). The signature of /fold/ is as
follows:

#+BEGIN_LaTeX
\begin{equation*}
\textrm{fold}
\left[S,T\right]
::
\left(S\rightarrow{T}\rightarrow{S}\right)
\rightarrow{S}
\rightarrow{\textrm{Sequence}\left[T\right]}
\rightarrow{S}
\end{equation*}
#+END_LaTeX

Read this, abstractly, as follows

#+BEGIN_QUOTE
\emph{Fold} over types $S$ and $T$ is a function that
takes three arguments:
1. another function (called the /accumulator function/)
2. an initial instance of type $S$
3. a sequence of instances of type $T$
and produces an instance of type $S$. The
accumulator function, in turn, is a binary function that takes an $S$ and a $T$ and
produces an $S$.
#+END_QUOTE

More concretely, In the context of Kalman filtering:

#+BEGIN_LaTeX
\begin{equation*}
\text{AccumulatorFunction}
::
\text{Accumulation}
\rightarrow
\text{Observation}
\rightarrow
\text{Accumulation}
\end{equation*}
#+END_LaTeX

\noindent where the types /Accumulation/ and /Observation/ are arbitrary. 

It's the job of /Fold/ to pass the elements of the input sequence to the
accumulator function one observation at a time, and to maintain and ultimately
return the final accumulation. The second argument to /Fold/ is
the desired, initial value of the accumulation. The
third and final argument to /Fold/ is the sequence of observations, of type
$\text{Sequence}\left[\,\text{Observation}\,\right]$

/Fold/ looks like a trinary function of an accumulator function, an
initial accumulation, and a sequence, yielding an accumulation. Folds thus have
the following type:

#+BEGIN_LaTeX
\begin{equation*}
\text{Fold :: }
\text{AccumulatorFunction}
\rightarrow
\text{Accumulation}
\rightarrow
\text{Sequence}\left[\,\text{Observation}\,\right]
\rightarrow
\text{Accumulation}
\end{equation*}
#+END_LaTeX

\noindent where /Sequence/ can be /List/, /Stream/, /Observable/, or any type
that can be accessed sequentially. 

* Over Lazy Streams and Asynchronous Observables

The accumulator function knows nothing about the source of the observations. If
we can figure out how to implement /Fold/ and /FoldList/ for things other than
/List/, we will have Kalman filtering over those sources, too.

The following are research-grade sketches of implementations of /Fold/ over lazy
streams[fn:musc] and asynchronous observables.[fn:intr] They provide just enough
to support the Kalman-folding examples.

