kalman-folding-04-009-streams-observables.tex

\subsection{A Test Example}
\label{sec:orgheadline2}

In the following  example, the observations \(\mathbold{z}\) are
\(1\times{1}\) matrices, equivalent to scalars, so \(b=1\).

The function in equation \ref{eqn:kalman-cume-definition}
\emph{lambda-lifts}\footnote{\url{https://en.wikipedia.org/wiki/Lambda_lifting}} \(\mathbold{Z}\), meaning that it is necessary to call
\emph{kalmanStatic} with a constant \(\mathbold{Z}\) to get the actual accumulator
function used in folds. This is desirable to reduce coupling between the
accumulator function and its calling environment. 

In Wolfram, this function is

\begin{verbatim}
kalmanStatic[Zeta_][{x_, P_}, {A_, z_}] :=
 Module[{D, K},
  D = Zeta + A.P.Transpose[A];
  K = P.Transpose[A].Inverse[D];
  {x2 + K.(z - A.x), P - K.D.Transpose[K]}]
\end{verbatim}

We test it on a small case

\begin{verbatim}
Fold[kalmanStatic[IdentityMatrix[1]],
  {ColumnVector[{0, 0, 0, 0}], IdentityMatrix[4]*1000.0},
  {{{{1,  0., 0.,  0.}}, { -2.28442}}, 
   {{{1,  1., 1.,  1.}}, { -4.83168}}, 
   {{{1, -1., 1., -1.}}, {-10.46010}}, 
   {{{1, -2., 4., -8.}}, {  1.40488}}, 
   {{{1,  2., 4.,  8.}}, {-40.8079}}}
  ] // Chop
~~>
\end{verbatim}

\begin{align}
\label{eqn:kalman-filter-results}
\mathbold{x} &=
\begin{bmatrix}
 -2.97423 \\
  7.2624  \\
 -4.21051 \\
 -4.45378 \\
\end{bmatrix}
\\
\notag
\mathbold{P} &=
\begin{bmatrix}
 0.485458 & 0 & -0.142778 & 0 \\
 0 & 0.901908 & 0 & -0.235882 \\
 -0.142778 & 0 & 0.0714031 & 0 \\
 0 & -0.235882 & 0 & 0.0693839 \\
\end{bmatrix}
\end{align}

\noindent expecting results within one or two standard deviations of the ground
truth \(\aleph=\begin{bmatrix}-3& 9& -4& -5\end{bmatrix}^\intercal\), where the
standard deviations can be found as square roots of the diagonal
elements of \(\mathbold{P}\). For details about this test case, see the first
paper in the series, \emph{Kalman Folding, Part 1}.\footnotemark[1]{}

Below, we reproduce these values exactly, to the bit level, by running
\emph{kalmanStatic} over lazy streams and asynchronous observables.

\section{Types for Kalman Folding}
\label{sec:orgheadline4}

Kalman and all its variants are examples of \emph{statistical function inversion.} We
have models that predict outcomes from inputs; we observe outcomes and want
estimates of the inputs. Structurally, all such incremental model inversions
take a pair of a state estimate (with uncertainty) and an observation, and
produce a new state estimate (with uncertainty). Such an inverted model has
signature, using a type notation similar to that of Haskell or Scala

\begin{equation*}
\textrm{inverted-model}
\left[S,T\right]
::
\left(S\rightarrow{T}\rightarrow{S}\right)
\end{equation*}

\noindent where the
return type is on the far right and the other types that appear before arrows
are the types of input arguments.
This function signature is exactly that required for the first argument of a
functional fold (more precisely, a \emph{left} fold). The signature of \emph{fold} is as
follows:

\begin{equation*}
\textrm{fold}
\left[S,T\right]
::
\left(S\rightarrow{T}\rightarrow{S}\right)
\rightarrow{S}
\rightarrow{\textrm{Sequence}\left[T\right]}
\rightarrow{S}
\end{equation*}

Read this, abstractly, as follows

\begin{quote}
\emph{Fold} over types \(S\) and \(T\) is a function that
takes three arguments:
\begin{enumerate}
\item another function (called the \emph{accumulator function})
\item an initial instance of type \(S\)
\item a sequence of instances of type \(T\)
\end{enumerate}
and produces an instance of type \(S\). The
accumulator function, in turn, is a binary function that takes an \(S\) and a \(T\) and
produces an \(S\).
\end{quote}

More concretely, In the context of Kalman filtering:

\begin{equation*}
\text{AccumulatorFunction}
::
\text{Accumulation}
\rightarrow
\text{Observation}
\rightarrow
\text{Accumulation}
\end{equation*}

\noindent where the types \emph{Accumulation} and \emph{Observation} are arbitrary. 

It's the job of \emph{Fold} to pass the elements of the input sequence to the
accumulator function one observation at a time, and to maintain and ultimately
return the final accumulation. The second argument to \emph{Fold} is
the desired, initial value of the accumulation. The
third and final argument to \emph{Fold} is the sequence of observations, of type
\(\text{Sequence}\left[\,\text{Observation}\,\right]\)

\emph{Fold} looks like a trinary function of an accumulator function, an
initial accumulation, and a sequence, yielding an accumulation. Folds thus have
the following type:

\begin{equation*}
\text{Fold :: }
\text{AccumulatorFunction}
\rightarrow
\text{Accumulation}
\rightarrow
\text{Sequence}\left[\,\text{Observation}\,\right]
\rightarrow
\text{Accumulation}
\end{equation*}

\noindent where \emph{Sequence} can be \emph{List}, \emph{Stream}, \emph{Observable}, or any type
that can be accessed sequentially. 

\section{Over Lazy Streams and Asynchronous Observables}
\label{sec:orgheadline16}

The accumulator function knows nothing about the source of the observations. If
we can figure out how to implement \emph{Fold} and \emph{FoldList} for things other than
\emph{List}, we will have Kalman filtering over those sources, too.

The following are research-grade sketches of implementations of \emph{Fold} over lazy
streams\footnote{\url{http://www1.cs.dartmouth.edu/~doug/music.ps.gz}} and asynchronous observables.\footnote{\url{http://introtorx.com/}} They provide just enough
to support the Kalman-folding examples.
