kalman-folding-04-009-streams-observables.tex

\subsection{Folding Over Lazy Streams}
\label{sec:orgheadline9}

Represent a lazy stream as a pair of a value and a \emph{thunk} (function of
no arguments).\footnote{This is quite similar to the standard --- not  Wolfram's --- definition of a list as a pair of a value and of another list.} The thunk must produce another lazy stream when called. Such
a stream can be infinite in abstract length because the elements of the stream are only
concretized in memory when demanded by calling thunks.

Streams are a natural fit for integrals of differential equations. We see in
other papers of this series how we an use them to deeply modularize filters
over rich non-linear models. In this paper, we show only how to fold a linear
Kalman filter over a stream.

By convention, a finite stream has a \texttt{Null} thunk at the end. Thus, the empty
stream, obtained by invoking such a thunk, is \texttt{Null[]}, with square brackets
denoting invocation with no arguments.

One of Wolfram's notations for a literal thunk is an expression with an
ampersand in postfix position. An ampersand turns the expression to its left
into a thunk. For instance, here's a function that returns an infinite stream of
natural numbers starting at \(n\):

\begin{verbatim}
integersFrom[n_Integer] := {n, integersFrom[n + 1] &}
\end{verbatim}

Calling, say, \texttt{integersFrom[42]} produces \texttt{\{42, integersFrom[42 + 1]\&\}}, a pair
of an integer, \(42\), and another stream, \texttt{integersFrom[42+1]\&}. We get the
stream by extracting the second part of the pair \emph{via} Wolfram's double-bracket notation

\begin{verbatim}
integersFrom[42][[2]] ~~> integersFrom[42 + 1]&
\end{verbatim}

\noindent and then call it with empty brackets (it's a thunk, and takes no
arguments):

\begin{verbatim}
integersFrom[42][[2]][] ~~> {43, integersFrom[43 + 1]&}
\end{verbatim}

\noindent and so on. We can get a few more by repeating the process

\begin{verbatim}
integersFrom[42][[2]][][[2]][][[2]][] ~~> {45, integersFrom[45 + 1]&}
\end{verbatim}

\noindent but the best way to extract values from streams is to write recursive
functions to demand any number of elements from the head. The variety of such
functions, which include \emph{map}, \emph{select}, \emph{fold}, is well known, large, and
identical across lists, streams, observables, and, in fact, any collection that
can support a \emph{next} operator. A good, contemporary full-service library for
collection types is LINQ's Standard Query Operators (SQO),\footnote{LINQ's Standard Query Operators}. If building
up a library from the present prototype level into something of product grade,
presentable to intolerant users, the SQO are an excellent framework to emulate.

As another example, the following function, when called with an appropriate
input, say the \(2\times{2}\) identity matrix, returns a lazy stream of matrices
full of Fibonacci numbers:

\begin{verbatim}
fs[f_] := {f, fs[{{0, 1}, {1, 1}}.f] &}
\end{verbatim}

Here is an explicit invocation a few values down:

\begin{verbatim}
fs[IdentityMatrix[2]][[2]][][[2]][][[2]][][[2]][][[2]][][[2]][][[
        2]][][[2]][][[2]][][[2]][]
~~>
\end{verbatim}
\begin{equation*}
\begin{Bmatrix}
\begin{pmatrix} 34 & 55 \\ 55 & 89 \end{pmatrix},
fs
\begin{bmatrix}
\begin{pmatrix} 34 & 55 \\ 55 & 89 \end{pmatrix} \cdot
\begin{pmatrix} 0 & 1 \\ 1 & 1 \end{pmatrix} 
\end{bmatrix}\, \&
\end{Bmatrix}
\end{equation*}

\noindent the point being that lazy streams are versatile. 

We now write bi-directional conversions between streams and lists so we can test
an example, then we write \emph{foldStream}.

\subsubsection{Disperse :: List \(\rightarrow\) Stream}
\label{sec:orgheadline5}

We'll need a way to convert a list into a stream.  There are three cases: an
empty list, a singleton list, and the inductive or recursive  case.

\begin{verbatim}
disperse[{}] := Null[]; (* empty list yields empty stream       *)
disperse[{x_}] := {x, Null}; (* the stream for a singleton list *)
disperse[{v_, xs__}] := {v, disperse[{xs}] &}; (* recursion     *)
\end{verbatim}

\subsubsection{Reify :: Stream \(\rightarrow\) List}
\label{sec:orgheadline6}

We need to go the other way, too; don't call this on a stream of infinite length:

\begin{verbatim}
reify[Null[]] := {};         (* produce empty list from empty stream *)
rify[{v_, Null}] := {v};     (* singleton list from singleton stream *)
reify[{v_, thunk_}] := Join[{v}, reify[thunk[]]]; (* recursion       *)
\end{verbatim}

\subsubsection{foldStream}
\label{sec:orgheadline7}

Our equivalent for Wolfram's \emph{FoldList} is \emph{foldStream}.\footnote{The initial uncial (lower-case) letter signifies that \emph{we} wrote this function; it wasn't supplied by Wolfram.} Its type is similar

\begin{align*}
\text{foldStream :: }
\text{AccumulatorFunction}
\rightarrow
\text{Accumulation}\\
\rightarrow
\text{Stream}\left[\,\text{Observation}\,\right]
\rightarrow
\text{Stream}\left[\,\text{Accumulation}\,\right]
\end{align*}

Here is an implementation:

\begin{verbatim}
foldStream[f_, s_, Null[]] := (* acting on an empty stream *)
  {s, Null}; (* produce a singleton stream containing 's'  *)
foldStream[f_, s_, {z_, thunk_}] :=
  (* pass in a new thunk that recurses on the old thunk    *)
  {s, foldStream[f, f[s, z], thunk[]] &};
\end{verbatim}

\subsubsection{Test}
\label{sec:orgheadline8}

Test it over the \emph{dispersion} of the example data:

\begin{verbatim}
foldStream[
  kalmanStatic[IdentityMatrix[1]], (* same 'kalmanStatic;' no changes *)
  {ColumnVector[{0, 0, 0, 0}], IdentityMatrix[4]*1000.0},
  disperse[{{{{1,  0., 0.,  0.}}, { -2.28442}}, 
            {{{1,  1., 1.,  1.}}, { -4.83168}}, 
            {{{1, -1., 1., -1.}}, {-10.46010}}, 
            {{{1, -2., 4., -8.}}, {  1.40488}}, 
            {{{1,  2., 4.,  8.}}, {-40.8079}}}]
  ] // reify
\end{verbatim}

The only changes to the earlier fold over lists is the initial call of \emph{disperse} to
convert the test case into a stream, and the final postfix call \texttt{// reify}
to turn the result back into a list for display. The final results are identical
to those in equation \ref{eqn:kalman-filter-results}, but we see all the
intermediate results as well, confirming that Kalman folds over observations one
at a time. We would have seen exactly the same output had we called \emph{FoldList}
instead of \emph{Fold} over lists above.

\begin{equation}
\label{eql:full-big-results}
\begin{pmatrix}
\begin{bmatrix}
 0 \\
 0 \\
 0 \\
 0 \\
\end{bmatrix}
&
\begin{bmatrix}
 1000. & 0 & 0 & 0 \\
 0 & 1000. & 0 & 0 \\
 0 & 0 & 1000. & 0 \\
 0 & 0 & 0 & 1000. \\
\end{bmatrix}
\\ & \\
\begin{bmatrix}
 -2.28214 \\
 0 \\
 0 \\
 0 \\
\end{bmatrix}
&
\begin{bmatrix}
 0.999001 & 0 & 0 & 0 \\
 0 & 1000. & 0 & 0 \\
 0 & 0 & 1000. & 0 \\
 0 & 0 & 0 & 1000. \\
\end{bmatrix}
\\ \\
\begin{bmatrix}
 -2.28299 \\
 -0.849281 \\
 -0.849281 \\
 -0.849281 \\
\end{bmatrix}
&
\begin{bmatrix}
 0.998669 & -0.332779 & -0.332779 & -0.332779 \\
 -0.332779 & 666.889 & -333.111 & -333.111 \\
 -0.332779 & -333.111 & 666.889 & -333.111 \\
 -0.332779 & -333.111 & -333.111 & 666.889 \\
\end{bmatrix}
\\ \\
\begin{bmatrix}
 -2.28749 \\
 1.40675 \\
 -5.35572 \\
 1.40675 \\
\end{bmatrix}
&
\begin{bmatrix}
 0.998004 & 0 & -0.997506 & 0 \\
 0 & 500.125 & 0 & -499.875 \\
 -0.997506 & 0 & 1.49676 & 0 \\
 0 & -499.875 & 0 & 500.125 \\
\end{bmatrix}
\\ \\
\begin{bmatrix}
 -2.29399 \\
 7.92347 \\
 -5.34488 \\
 -5.1154 \\
\end{bmatrix}
&
\begin{bmatrix}
 0.997508 & 0.49762 & -0.996678 & -0.498035 \\
 0.49762 & 1.3855 & -0.829836 & -0.719881 \\
 -0.996678 & -0.829836 & 1.49538 & 0.830528 \\
 -0.498035 & -0.719881 & 0.830528 & 0.553787 \\
\end{bmatrix}
\\ \\
\begin{bmatrix}
 -2.97423 \\
 7.2624 \\
 -4.21051 \\
 -4.45378 \\
\end{bmatrix}
&
\begin{bmatrix}
 0.485458 & 0 & -0.142778 & 0 \\
 0 & 0.901908 & 0 & -0.235882 \\
 -0.142778 & 0 & 0.0714031 & 0 \\
 0 & -0.235882 & 0 & 0.0693839 \\
\end{bmatrix}
\end{pmatrix}
\end{equation}
