kalman-folding-04-009-streams-observables.org
** Folding Over an Asynchronous Observable

Just as /FoldList/ produces a list from a list, and /foldStream/ produces a
stream from a stream, /foldObservable/ produces an observable from an
observable. Its full signature is

#+BEGIN_LaTeX
\begin{align*}
\text{foldObservable :: }
\text{AccumulatorFunction}
\rightarrow
\text{Accumulation}\\
\rightarrow
\text{Observable}\left[\,\text{Observation}\,\right]
\rightarrow
\text{Observable}\left[\,\text{Accumulation}\,\right]
\end{align*}
#+END_LaTeX

Lists provide data elements distributed in space (memory). Lazy streams provide
data in constant memory, but distributed in a kind of virtual time, delivered
when demanded, the way a debugger fakes time. Observables provide data elements
distributed asynchronously in real time. To consume elements of an observable,
subscribe an observer to it. An observer has a callback function, and the
observable will invoke the callback for each observation, asynchronously, as the
observation arrives. The callback function takes a single argument that receives
the observation.

#+BEGIN_COMMENT
One pretty way to consume elements from a list is with a function like Scala's
/foreach/,[fn:scla] which takes a callback function and calls it for each
element in the sequence. This is /just like/ the /Subscribe/ function of the
standard Observable interface, so much so that we may regard /foreach/ and
/Subscribe/ as semantically identical. Thus, building a simulacrum of Observable
for the sake of testing Kalman folding is not much harder than writing
/foreach/. We do  not develop observables fully, here. For that, see a
reference like Campbell's /Intro to Rx/.[fn:intr] Instead, we content ourselves
with a simulacrum and, as with Lazy Streams, a way to get back and forth from
Wolfram's lists.
#+END_COMMENT

We do not develop observables fully, here. For that, see a reference like
Campbell's /Intro to Rx/.[fn:intr] Instead, we content ourselves with just
enough to demonstrate Kalman folding over them and, as with lazy streams, a way
to get back and forth from lists.

We model observables as stateful thunks that produce new values every time
they're invoked, then invoke the thunks inside asynchronous Wolfram tasks that
start at the moment some observer subscribes.[fn:cold]

*** Subscribe :: Observable $\rightarrow$ Observer $\rightarrow$ Null

Wolfram supplies a primitive, /RunScheduledTask/, for evaluating expressions
asynchronously, once per second by default. The expression that we pass to
/RunScheduledTask/, just calls the observer on the evaluated observable:

#+BEGIN_LaTeX
\begin{verbatim}
subscribe[observable_, observer_] :=
  RunScheduledTask[observer[observable[]]];
\end{verbatim}
#+END_LaTeX

*** Dispense :: List $\rightarrow$ Observable

The following is a specification of a task to run. Nothing happens till you
subscribe something to it. 

#+BEGIN_LaTeX
\begin{verbatim}
dispense[aList_List] :=
 Module[{state = aList},
  If[{} === state,
    Null, (* empty obs from empty list *)
    (state = Rest[state]; First[state]]);] &]
\end{verbatim}
#+END_LaTeX

*** Harvest :: Observable $\rightarrow$ List

Set up a conventional, external variable, ~r$~, so that we can interactively
look at the results in a Wolfram ~Dynamic[r$]~ form. Our /harvest/ 
subscribes an observer that appends observations to a list held in ~r$~.
Semicolon-separated expressions are sequenced, as with Scheme's ~begin~ or
Lisp's ~progn~.

#+BEGIN_LaTeX
\begin{verbatim}
harvest[obl_] :=
  (r$ = {};
   subscribe[obl, Function[v, If[v =!= Null, AppendTo[r$, v]]]]);
\end{verbatim}
#+END_LaTeX

We must eventually clean up the tasks and the external variable.

#+BEGIN_LaTeX
\begin{verbatim}
cleanup[] := (ClearAll[r$];
              RemoveScheduledTask[ScheduledTasks[]];);
\end{verbatim}
#+END_LaTeX

*** foldObservable 

The concrete type of /foldObservable/ is obvious: just replace /Stream/ with
/Observable/ in a copy of the type of /foldStream/.

#+BEGIN_LaTeX
\begin{align*}
\text{foldObservable :: }
\text{AccumulatorFunction}
\rightarrow
\text{Accumulation}\\
\rightarrow
\text{Observable}\left[\,\text{Observation}\,\right]
\rightarrow
\text{Observable}\left[\,\text{Accumulation}\,\right]
\end{align*}
#+END_LaTeX

One might ask about the appropriate generalization of higher-order types like
this, where we could go up a level, parameterize on types like /Stream/ and
/Observable/, and make the concrete types of /foldStream/ and /foldObservable/
instances of that higher, parameterized type. This is a sensible question, and
the answer leads to category theory and monads,[fn:mond] out of scope for this
paper.

This implementation isn't hygeinic: it uses global variables (suffixed with ~$~
signs). It's just enough to test Kalman folding over observables.

#+BEGIN_LaTeX
\begin{verbatim}
foldObservable[f_, s_, obl_] :=
 Module[{newObl, s$ = s},
  newObl[] := With[{result = s$},
    s$ = f[s$, obl[]];
    result];
  newObl] (* return new observable *)
\end{verbatim}
#+END_LaTeX

*** Test

The following call has the same shape as our call of /foldStream/ above, except
calling /dispense/ instead of /disperse/ and /harvest/ instead of /reify/.

#+BEGIN_LaTeX
\begin{verbatim}
Dynamic[r$]
foldObservable[
  kalmanStatic[IdentityMatrix[1]],
  {ColumnVector[{0, 0, 0, 0}], IdentityMatrix[4]*1000.0},
  dispense[{{{{1,  0., 0.,  0.}}, { -2.28442}}, 
            {{{1,  1., 1.,  1.}}, { -4.83168}}, 
            {{{1, -1., 1., -1.}}, {-10.46010}}, 
            {{{1, -2., 4., -8.}}, {  1.40488}}, 
            {{{1,  2., 4.,  8.}}, {-40.8079}}}]
  ] // harvest;
r$
\end{verbatim}
#+END_LaTeX

The results are exactly the same as in equation \ref{eql:full-big-results}. 

