kalman-folding-04-009-streams-observables.tex

\subsection{Folding Over an Asynchronous Observable}
\label{sec:orgheadline15}

Just as \emph{FoldList} produces a list from a list, and \emph{foldStream} produces a
stream from a stream, \emph{foldObservable} produces an observable from an
observable. Its full signature is

\begin{align*}
\text{foldObservable :: }
\text{AccumulatorFunction}
\rightarrow
\text{Accumulation}\\
\rightarrow
\text{Observable}\left[\,\text{Observation}\,\right]
\rightarrow
\text{Observable}\left[\,\text{Accumulation}\,\right]
\end{align*}

Lists provide data elements distributed in space (memory). Lazy streams provide
data in constant memory, but distributed in a kind of virtual time, delivered
when demanded, the way a debugger fakes time. Observables provide data elements
distributed asynchronously in real time. To consume elements of an observable,
subscribe an observer to it. An observer has a callback function, and the
observable will invoke the callback for each observation, asynchronously, as the
observation arrives. The callback function takes a single argument that receives
the observation.

We do not develop observables fully, here. For that, see a reference like
Campbell's \emph{Intro to Rx}.\footnotemark[5]{} Instead, we content ourselves with just
enough to demonstrate Kalman folding over them and, as with lazy streams, a way
to get back and forth from lists.

We model observables as stateful thunks that produce new values every time
they're invoked, then invoke the thunks inside asynchronous Wolfram tasks that
start at the moment some observer subscribes.\footnote{This convention only models so-called \emph{cold observables}, but it's enough to demonstrate Kalman's working over them.}

\subsubsection{Subscribe :: Observable \(\rightarrow\) Observer \(\rightarrow\) Null}
\label{sec:orgheadline10}

Wolfram supplies a primitive, \emph{RunScheduledTask}, for evaluating expressions
asynchronously, once per second by default. The expression that we pass to
\emph{RunScheduledTask}, just calls the observer on the evaluated observable:

\begin{verbatim}
subscribe[observable_, observer_] :=
  RunScheduledTask[observer[observable[]]];
\end{verbatim}

\subsubsection{Dispense :: List \(\rightarrow\) Observable}
\label{sec:orgheadline11}

The following is a specification of a task to run. Nothing happens till you
subscribe something to it. 

\begin{verbatim}
dispense[aList_List] :=
 Module[{state = aList},
  If[{} === state,
    Null, (* empty obs from empty list *)
    (state = Rest[state]; First[state]]);] &]
\end{verbatim}

\subsubsection{Harvest :: Observable \(\rightarrow\) List}
\label{sec:orgheadline12}

Set up a conventional, external variable, \texttt{r\$}, so that we can interactively
look at the results in a Wolfram \texttt{Dynamic[r\$]} form. Our \emph{harvest} 
subscribes an observer that appends observations to a list held in \texttt{r\$}.
Semicolon-separated expressions are sequenced, as with Scheme's \texttt{begin} or
Lisp's \texttt{progn}.

\begin{verbatim}
harvest[obl_] :=
  (r$ = {};
   subscribe[obl, Function[v, If[v =!= Null, AppendTo[r$, v]]]]);
\end{verbatim}

We must eventually clean up the tasks and the external variable.

\begin{verbatim}
cleanup[] := (ClearAll[r$];
              RemoveScheduledTask[ScheduledTasks[]];);
\end{verbatim}

\subsubsection{foldObservable}
\label{sec:orgheadline13}

The concrete type of \emph{foldObservable} is obvious: just replace \emph{Stream} with
\emph{Observable} in a copy of the type of \emph{foldStream}.

\begin{align*}
\text{foldObservable :: }
\text{AccumulatorFunction}
\rightarrow
\text{Accumulation}\\
\rightarrow
\text{Observable}\left[\,\text{Observation}\,\right]
\rightarrow
\text{Observable}\left[\,\text{Accumulation}\,\right]
\end{align*}

One might ask about the appropriate generalization of higher-order types like
this, where we could go up a level, parameterize on types like \emph{Stream} and
\emph{Observable}, and make the concrete types of \emph{foldStream} and \emph{foldObservable}
instances of that higher, parameterized type. This is a sensible question, and
the answer leads to category theory and monads,\footnote{\url{https://en.wikipedia.org/wiki/Monad}} out of scope for this
paper.

This implementation isn't hygeinic: it uses global variables (suffixed with \texttt{\$}
signs). It's just enough to test Kalman folding over observables.

\begin{verbatim}
foldObservable[f_, s_, obl_] :=
 Module[{newObl, s$ = s},
  newObl[] := With[{result = s$},
    s$ = f[s$, obl[]];
    result];
  newObl] (* return new observable *)
\end{verbatim}

\subsubsection{Test}
\label{sec:orgheadline14}

The following call has the same shape as our call of \emph{foldStream} above, except
calling \emph{dispense} instead of \emph{disperse} and \emph{harvest} instead of \emph{reify}.

\begin{verbatim}
Dynamic[r$]
foldObservable[
  kalmanStatic[IdentityMatrix[1]],
  {ColumnVector[{0, 0, 0, 0}], IdentityMatrix[4]*1000.0},
  dispense[{{{{1,  0., 0.,  0.}}, { -2.28442}}, 
            {{{1,  1., 1.,  1.}}, { -4.83168}}, 
            {{{1, -1., 1., -1.}}, {-10.46010}}, 
            {{{1, -2., 4., -8.}}, {  1.40488}}, 
            {{{1,  2., 4.,  8.}}, {-40.8079}}}]
  ] // harvest;
r$
\end{verbatim}

The results are exactly the same as in equation \ref{eql:full-big-results}. 
