kalman-folding-04-009-streams-observables.tex

\section{Concluding Remarks}
\label{sec:orgheadline17}

With prototypes for \emph{foldStream} and \emph{foldObservable}, we have demonstrated
Kalman folding with exactly the same accumulator function over wildly different
data-delivery environments. This demonstrates the primary thesis of this series
of papers: that writing filters as functional folds enables verbatim deployment
of code in both friendly, synchronous environments with all data in memory, and
unfriendly asynchronous environments using only constant memory. Verbatim means
with no changes at all, not even recompilation. 

We have tested these prototypes against bigger
examples like the tracking example\footnote{B. Beckman, \emph{Kalman Folding 2: Tracking and System Dynamics}, \url{http://vixra.org/abs/1606.0348}.} and the accelerometer
example,\footnotemark[1]{} and there are no surprises.
\end{document}